#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️``
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_dynamodb_table.lobbies will be created
  + resource "aws_dynamodb_table" "lobbies" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Id"
      + id               = (known after apply)
      + name             = "prpr1922581099-Lobbies"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "prpr1922581099"
          + "Project"     = "wheel-react-native"
          + "Terraform"   = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Id"
          + type = "S"
        }

      + ttl {
          + attribute_name = "TTL"
          + enabled        = true
        }
    }

  # aws_dynamodb_table.users will be created
  + resource "aws_dynamodb_table" "users" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Id"
      + id               = (known after apply)
      + name             = "prpr1922581099-Users"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "prpr1922581099"
          + "Project"     = "wheel-react-native"
          + "Terraform"   = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Id"
          + type = "S"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

#### OpenTofu Apply 🚀`success`

<details><summary>Apply Output</summary>

```


OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_dynamodb_table.lobbies will be created
  + resource "aws_dynamodb_table" "lobbies" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Id"
      + id               = (known after apply)
      + name             = "prpr1922581099-Lobbies"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "prpr1922581099"
          + "Project"     = "wheel-react-native"
          + "Terraform"   = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Id"
          + type = "S"
        }

      + ttl {
          + attribute_name = "TTL"
          + enabled        = true
        }
    }

  # aws_dynamodb_table.users will be created
  + resource "aws_dynamodb_table" "users" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Id"
      + id               = (known after apply)
      + name             = "prpr1922581099-Users"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "prpr1922581099"
          + "Project"     = "wheel-react-native"
          + "Terraform"   = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Id"
          + type = "S"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_dynamodb_table.users: Creating...
aws_dynamodb_table.lobbies: Creating...
aws_dynamodb_table.lobbies: Creation complete after 8s [id=prpr1922581099-Lobbies]
aws_dynamodb_table.users: Still creating... [10s elapsed]
aws_dynamodb_table.users: Creation complete after 14s [id=prpr1922581099-Users]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>


*Pusher: @VictorShan, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*